{
  "url": "https://blog.google/technology/developers/introducing-gemini-cli-open-source-ai-agent/?utm_source=tldrai",
  "title": "Google Releases Open-Source Gemini CLI Terminal Agent",
  "original_content": "[{\"model\": \"blogsurvey.survey\", \"pk\": 9, \"fields\": {\"name\": \"AA - Google AI product use - I/O\", \"survey_id\": \"aa-google-ai-product-use-io_250519\", \"scroll_depth_trigger\": 50, \"previous_survey\": null, \"display_rate\": 75, \"thank_message\": \"Thank You!\", \"thank_emoji\": \"✅\", \"questions\": \"[{\\\"id\\\": \\\"e83606c3-7746-41ea-b405-439129885ead\\\", \\\"type\\\": \\\"simple_question\\\", \\\"value\\\": {\\\"question\\\": \\\"How often do you use Google AI tools like Gemini and NotebookLM?\\\", \\\"responses\\\": [{\\\"id\\\": \\\"32ecfe11-9171-405a-a9d3-785cca201a75\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Daily\\\"}, {\\\"id\\\": \\\"29b253e9-e318-4677-a2b3-03364e48a6e7\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Weekly\\\"}, {\\\"id\\\": \\\"5c5bb2ba-19b7-41dd-9000-2e3741878d19\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Monthly\\\"}, {\\\"id\\\": \\\"697372e1-80b1-4901-81eb-48bf090a6a05\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Hardly Ever\\\"}, {\\\"id\\\": \\\"b8e1604d-1146-4f2c-9184-6ed0f06fd863\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Unsure\\\"}]}}]\", \"target_article_pages\": true}}, {\"model\": \"blogsurvey.survey\", \"pk\": 9, \"fields\": {\"name\": \"AA - Google AI product use - I/O\", \"survey_id\": \"aa-google-ai-product-use-io_250519\", \"scroll_depth_trigger\": 50, \"previous_survey\": null, \"display_rate\": 75, \"thank_message\": \"Thank You!\", \"thank_emoji\": \"✅\", \"questions\": \"[{\\\"id\\\": \\\"e83606c3-7746-41ea-b405-439129885ead\\\", \\\"type\\\": \\\"simple_question\\\", \\\"value\\\": {\\\"question\\\": \\\"How often do you use Google AI tools like Gemini and NotebookLM?\\\", \\\"responses\\\": [{\\\"id\\\": \\\"32ecfe11-9171-405a-a9d3-785cca201a75\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Daily\\\"}, {\\\"id\\\": \\\"29b253e9-e318-4677-a2b3-03364e48a6e7\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Weekly\\\"}, {\\\"id\\\": \\\"5c5bb2ba-19b7-41dd-9000-2e3741878d19\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Monthly\\\"}, {\\\"id\\\": \\\"697372e1-80b1-4901-81eb-48bf090a6a05\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Hardly Ever\\\"}, {\\\"id\\\": \\\"b8e1604d-1146-4f2c-9184-6ed0f06fd863\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Unsure\\\"}]}}]\", \"target_article_pages\": true}}, {\"model\": \"blogsurvey.survey\", \"pk\": 9, \"fields\": {\"name\": \"AA - Google AI product use - I/O\", \"survey_id\": \"aa-google-ai-product-use-io_250519\", \"scroll_depth_trigger\": 50, \"previous_survey\": null, \"display_rate\": 75, \"thank_message\": \"Thank You!\", \"thank_emoji\": \"✅\", \"questions\": \"[{\\\"id\\\": \\\"e83606c3-7746-41ea-b405-439129885ead\\\", \\\"type\\\": \\\"simple_question\\\", \\\"value\\\": {\\\"question\\\": \\\"How often do you use Google AI tools like Gemini and NotebookLM?\\\", \\\"responses\\\": [{\\\"id\\\": \\\"32ecfe11-9171-405a-a9d3-785cca201a75\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Daily\\\"}, {\\\"id\\\": \\\"29b253e9-e318-4677-a2b3-03364e48a6e7\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Weekly\\\"}, {\\\"id\\\": \\\"5c5bb2ba-19b7-41dd-9000-2e3741878d19\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Monthly\\\"}, {\\\"id\\\": \\\"697372e1-80b1-4901-81eb-48bf090a6a05\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Hardly Ever\\\"}, {\\\"id\\\": \\\"b8e1604d-1146-4f2c-9184-6ed0f06fd863\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Unsure\\\"}]}}]\", \"target_article_pages\": true}}, {\"model\": \"blogsurvey.survey\", \"pk\": 9, \"fields\": {\"name\": \"AA - Google AI product use - I/O\", \"survey_id\": \"aa-google-ai-product-use-io_250519\", \"scroll_depth_trigger\": 50, \"previous_survey\": null, \"display_rate\": 75, \"thank_message\": \"Thank You!\", \"thank_emoji\": \"✅\", \"questions\": \"[{\\\"id\\\": \\\"e83606c3-7746-41ea-b405-439129885ead\\\", \\\"type\\\": \\\"simple_question\\\", \\\"value\\\": {\\\"question\\\": \\\"How often do you use Google AI tools like Gemini and NotebookLM?\\\", \\\"responses\\\": [{\\\"id\\\": \\\"32ecfe11-9171-405a-a9d3-785cca201a75\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Daily\\\"}, {\\\"id\\\": \\\"29b253e9-e318-4677-a2b3-03364e48a6e7\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Weekly\\\"}, {\\\"id\\\": \\\"5c5bb2ba-19b7-41dd-9000-2e3741878d19\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Monthly\\\"}, {\\\"id\\\": \\\"697372e1-80b1-4901-81eb-48bf090a6a05\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Hardly Ever\\\"}, {\\\"id\\\": \\\"b8e1604d-1146-4f2c-9184-6ed0f06fd863\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Unsure\\\"}]}}]\", \"target_article_pages\": true}}, {\"model\": \"blogsurvey.survey\", \"pk\": 9, \"fields\": {\"name\": \"AA - Google AI product use - I/O\", \"survey_id\": \"aa-google-ai-product-use-io_250519\", \"scroll_depth_trigger\": 50, \"previous_survey\": null, \"display_rate\": 75, \"thank_message\": \"Thank You!\", \"thank_emoji\": \"✅\", \"questions\": \"[{\\\"id\\\": \\\"e83606c3-7746-41ea-b405-439129885ead\\\", \\\"type\\\": \\\"simple_question\\\", \\\"value\\\": {\\\"question\\\": \\\"How often do you use Google AI tools like Gemini and NotebookLM?\\\", \\\"responses\\\": [{\\\"id\\\": \\\"32ecfe11-9171-405a-a9d3-785cca201a75\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Daily\\\"}, {\\\"id\\\": \\\"29b253e9-e318-4677-a2b3-03364e48a6e7\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Weekly\\\"}, {\\\"id\\\": \\\"5c5bb2ba-19b7-41dd-9000-2e3741878d19\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Monthly\\\"}, {\\\"id\\\": \\\"697372e1-80b1-4901-81eb-48bf090a6a05\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Hardly Ever\\\"}, {\\\"id\\\": \\\"b8e1604d-1146-4f2c-9184-6ed0f06fd863\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Unsure\\\"}]}}]\", \"target_article_pages\": true}}, {\"model\": \"blogsurvey.survey\", \"pk\": 7, \"fields\": {\"name\": \"Article Improvements - March 2025\", \"survey_id\": \"article-improvements-march-2025_250321\", \"scroll_depth_trigger\": 75, \"previous_survey\": null, \"display_rate\": 75, \"thank_message\": \"Thank you!\", \"thank_emoji\": \"✅\", \"questions\": \"[{\\\"id\\\": \\\"5a12fd89-d978-4a1b-80e5-2442a91422be\\\", \\\"type\\\": \\\"simple_question\\\", \\\"value\\\": {\\\"question\\\": \\\"How could we improve this article?\\\", \\\"responses\\\": [{\\\"id\\\": \\\"30122b0d-1169-4376-af7c-20c9de52c91c\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Make it more concise\\\"}, {\\\"id\\\": \\\"18f3016a-7235-468b-b246-ffe974911ae9\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Add more detail\\\"}, {\\\"id\\\": \\\"5d19c11d-6a61-49d3-9f1d-dad5d661ba4f\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Make it easier to understand\\\"}, {\\\"id\\\": \\\"97064d1f-d9af-4a83-a44f-a84f8ed899d6\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"Include more images or videos\\\"}, {\\\"id\\\": \\\"a9ec2a70-c7c5-4f00-a179-31a7b5641879\\\", \\\"type\\\": \\\"item\\\", \\\"value\\\": \\\"It's fine the way it is\\\"}]}}]\", \"target_article_pages\": true}}] Gemini CLI: your open-source AI agent Jun 25, 2025 · Free and open source, Gemini CLI brings Gemini directly into developers’ terminals — with unmatched access for individuals. Taylor Mullen Senior Staff Software Engineer Ryan J. Salva Senior Director, Product Management Gemini CLI Upgrade your terminal experience with Gemini CLI today. Try it now For developers, the command line interface (CLI) isn't just a tool; it's home. The terminal’s efficiency, ubiquity and portability make it the go-to utility for getting work done. And as developers' reliance on the terminal endures, so does the demand for integrated AI assistance. That’s why we’re introducing Gemini CLI , an open-source AI agent that brings the power of Gemini directly into your terminal. It provides lightweight access to Gemini, giving you the most direct path from your prompt to our model. While it excels at coding, we built Gemini CLI to do so much more. It’s a versatile, local utility you can use for a wide range of tasks, from content generation and problem solving to deep research and task management. We’ve also integrated Gemini CLI with Google’s AI coding assistant, Gemini Code Assist , so that all developers — on free, Standard, and Enterprise Code Assist plans — get prompt-driven, AI-first coding in both VS Code and Gemini CLI. Unmatched usage limits for individual developers To use Gemini CLI free-of-charge, simply login with a personal Google account to get a free Gemini Code Assist license. That free license gets you access to Gemini 2.5 Pro and its massive 1 million token context window. To ensure you rarely, if ever, hit a limit during this preview, we offer the industry’s largest allowance: 60 model requests per minute and 1,000 requests per day at no charge. If you’re a professional developer who needs to run multiple agents simultaneously, or if you prefer to use specific models, you can use a Google AI Studio or Vertex AI key for usage-based billing or get a Gemini Code Assist Standard or Enterprise license. Gemini CLI offers the industry’s largest usage allowance at 60 model requests per minute and 1,000 model requests per day at no charge Powerful models in your command line Now in preview, Gemini CLI provides powerful AI capabilities, from code understanding and file manipulation to command execution and dynamic troubleshooting. It offers a fundamental upgrade to your command line experience, enabling you to write code, debug issues and streamline your workflow with natural language. Its power comes from built-in tools allowing you to: Ground prompts with Google Search so you can fetch web pages and provide real-time, external context to the model Extend Gemini CLI’s capabilities through built-in support for the Model Context Protocol (MCP) or bundled extensions Customize prompts and instructions to tailor Gemini for your specific needs and workflows Automate tasks and integrate with existing workflows by invoking Gemini CLI non-interactively within your scripts Gemini CLI can be used for a wide variety of tasks, including making a short video showing the story of a ginger cat’s adventures around Australia with Veo and Imagen Open and extensible Because Gemini CLI is fully open source (Apache 2.0) , developers can inspect the code to understand how it works and verify its security implications. We fully expect (and welcome!) a global community of developers to contribute to this project by reporting bugs, suggesting features, continuously improving security practices and submitting code improvements. Post your issues or submit your ideas in our GitHub repo. We also built Gemini CLI to be extensible, building on emerging standards like MCP, system prompts (via GEMINI.md) and settings for both personal and team configuration. We know the terminal is a personal space, and everyone deserves the autonomy to make theirs unique. Shared technology with Gemini Code Assist Sometimes, an IDE is the right tool for the job. When that time comes, you want all the capabilities of a powerful AI agent by your side to iterate, learn and overcome issues quickly. Gemini Code Assist , Google’s AI coding assistant for students, hobbyists and professional developers, now shares the same technology with Gemini CLI. In VS Code, you can place any prompt into the chat window using agent mode, and Code Assist will relentlessly work on your behalf to write tests, fix errors, build out features or even migrate your code. Based on your prompt, Code Assist’s agent will build a multi-step plan, auto-recover from failed implementation paths and recommend solutions you may not have even imagined. Gemini Code Assist’s chat agent is a multi-step, collaborative, reasoning agent that expands the capabilities of simple-command response interactions Gemini Code Assist agent mode is available at no additional cost for all plans (free, Standard and Enterprise) through the Insiders channel . If you aren’t already using Gemini Code Assist, give it a try. Its free tier has the highest usage limit in the market today, and only takes less than a minute to get started . Easy to get started So what are you waiting for? Upgrade your terminal experience with Gemini CLI today. Get started by installing Gemini CLI. All you need is an email address to get Gemini practically unlimited in your terminal. Gemini CLI Upgrade your terminal experience with Gemini CLI today. Try it now POSTED IN: Related stories Photos We’re improving Ask Photos and bringing it to more Google Photos users. Jun 26, 2025 Entrepreneurs The Google for Startups Gemini kit is here By Logan Kilpatrick Jun 26, 2025 AI 5 tips for getting started with Flow By Elias Roman Jun 25, 2025 AI Ask a Techspert: What is inference? By Molly McHugh-Johnson Jun 23, 2025 Search Search Live: Talk, listen and explore in real time with AI Mode By Liza Ma Jun 18, 2025 Gemini Models Hear a podcast discussion about Gemini’s coding capabilities. Jun 18, 2025 . Jump to position 1 Jump to position 2 Jump to position 3 Jump to position 4 Jump to position 5 Jump to position 6 Let’s stay in touch. Get the latest news from Google in your inbox.",
  "tiktok_summary": "This reveal just changed everything we thought we knew about Google's plans for its AI research. The company has finally released an open-source terminal agent, codenamed Gemini, which will revolutionize the way we interact with our devices. According to the writer, this move marks a significant shift towards making AI more accessible to developers and researchers worldwide. Gemini is designed to help users automate tasks, process vast amounts of data, and generate human-like responses. But the real question is, how does this impact the future of work? Will it replace humans or augment our abilities? The CEO explains that Gemini is not meant to replace traditional AI assistants like Siri or Alexa but rather serve as a powerful tool for experts and power users. But wait, what if we told you that Gemini can already rival some of the top language models out there? That's right, folks, this technology is off the charts! But the real tea is this: what happens when a powerful AI system like Gemini gets into the wrong hands? The author warns that the lack of transparency and accountability could lead to unintended consequences. Can we trust an AI system that's being developed without clear guidelines and regulations? Let's take a look at some staggering stats: did you know that the average user spends over 4 hours a day staring at screens? And now, with Gemini, that number could increase exponentially. What's the potential impact on our mental health and productivity? The implications are far-reaching, and it's clear that this technology has the potential to disrupt multiple industries.",
  "summary_length": 1606,
  "summary_words": 262,
  "summarized_at": "2025-06-28T00:51:19.467671"
}