{
  "url": "https://warontherocks.com/2025/06/i-fought-in-ukraine-and-heres-why-fpv-drones-kind-of-suck/?utm_source=tldrnewsletter",
  "title": "I Fought in Ukraine and Here's Why FPV Drones Kind of Suck",
  "original_content": "When the world's at stake, go beyond the headlines. National security. For insiders. By insiders. National security. For insiders. By insiders. Join War on the Rocks and gain access to content trusted by policymakers, military leaders, and strategic thinkers worldwide. BECOME A MEMBER BECOME A MEMBER Commentary I Fought in Ukraine and Here’s Why FPV Drones Kind of Suck June 26, 2025 Commentary I Fought in Ukraine and Here’s Why FPV Drones Kind of Suck Jakub Jajcay June 26, 2025 Jakub Jajcay In 2024 and 2025, I served for six months as an international volunteer on a first-person view attack drone team in the Armed Forces of Ukraine. My team was deployed in the Donbas region, in one of the hottest sectors of the front. When I joined the team, I was excited to work with a cutting-edge tool. By the end of my deployment, I was a bit disillusioned. Let me tell you why. First-person view drones are unmanned aerial vehicles with four propellers located at the four corners of the craft, roughly in the shape of a square of seven to 12 inches in length on each side. They are controlled by an operator wearing virtual-reality goggles that receive the image from the drone’s forward-facing camera (hence the name first-person view). The most common types of first-person view drones are single-use: They fly directly into their target, where they detonate an explosive charge of up to 1.5 kilograms. These drones are touted as a cheap and accessible solution that can give troops on the tactical level their own organic precision-strike capability. They can supposedly react quickly and strike moving targets or targets in difficult-to-reach locations, such as bunkers, basements, or inside buildings. Proponents of first-person view drones often repeat the claim that as much as 60 to 70 percent of all battlefield casualties in the Russo-Ukrainian War are now caused by drones. This statistic is probably broadly accurate, though it does not differentiate between casualties caused by first-person view drones and other types of uncrewed aerial systems. Some authors, including experienced military officers writing in these pages, go even further and claim that first-person view drones will precipitate a revolution in how wars are fought, akin to the introduction of muskets. Among other things, they will make concealment and the massing of troops and equipment in the combat zone nearly impossible. Any concentration of troops or vehicles will supposedly be observed immediately and butchered by swarms of cheap, fast drones. Proponents of drones, especially in Silicon Valley, have claimed that drones might completely replace artillery. Whether or not we believe these far-reaching claims, we’ve certainly all seen the videos on social media of these drones performing impressive, highly precise attacks. We’ve seen them striking a Russian tank on the move , flying through the open back hatch of an infantry fighting vehicle, or entering a building to surprise the enemy, sometimes literally, with their pants down . But those impressive strikes are rare exceptions. The cases when first-person view drones actually do that are few and far between. BECOME A MEMBER During my time in Ukraine, I collected statistics on the success of our drone operations. I found that 43 percent of our sorties resulted in a hit on the intended target in the sense that the drone was able to successfully fly all the way to the target, identify it correctly, hit it, and the drone’s explosive charge detonated as it was supposed to. This number does not include instances when our higher command requested a sortie but we had to decline because we knew that we could not strike the target for reasons such as weather, technical problems, or electronic interference. If this type of pre-aborted mission is included in the total, the success rate drops to between 20 and 30 percent. On the face of it, this success rate is bad, but that is not the whole story. I began to notice that the vast majority of our sorties were against targets that had already been struck successfully by a different weapons system, most commonly by a mortar or by a munition dropped by a reusable drone (in other words, not a first-person view drone). Put differently, the goal of the majority of our missions was to deliver the second tap in a double-tap strike against a target that had already been successfully prosecuted by a different weapons system. The proportion of missions when we successfully carried out a task that only a first-person view drone can fulfill — delivering a precision strike on a target that could not be hit by other means — was in the single-digit percent. There are two reasons why these drones rarely successfully do what they were designed to do. The first has to do with how commanders choose to employ first-person view drones. Presumably, our commanders decided that they had first-person view drones as a capability, so they might as well use them, even if there were other weapons systems that could also do the job. There is a certain logic to this, and the commanders were not paying for the expended drones out of their own pockets. They were more focused on the immediate mission. While first-person view drones are cheap, they are usually not the cheapest option available to commanders. This is the problem with using them in double-tap strikes or for missions that can be achieved by other systems. One of these drone sorties costs about $500 in materiel. A mortar shell costs less than $100. A munition dropped from a reusable drone, usually also something like a modified mortar shell or 40-millimeter grenade, also costs less than $100. The second reason why these drones rarely do what they were designed to do is technical. They are finicky, unreliable, hard to use, and susceptible to electronic interference. Few first-person view drones have night-vision capability. Those that do are in short supply and cost twice as much as the base model. In Ukraine, in the winter, it’s dark for 14 hours a day. Wind, rain, snow, and fog all mean a drone cannot fly. A solid quarter of all these drones have some sort of technical fault that prevents them from taking off. This is usually discovered only when they are being prepped for launch. The most common is a fault in the radio receiver that receives inputs from the control panel, or in the video transmitter that transmits the signal to the operator’s virtual-reality goggles. Sometimes this fault can be fixed through a software update in the field. Often, it cannot. Many faulty drones are simply cannibalized for spare parts, because there is no better use for them. Even once a drone is airborne, batteries often die mid-flight. In about 10 percent of sorties, the drone hits the target, but its warhead does not detonate. Once airborne, operating a first-person view drone successfully is not easy. These drones were originally designed to be toys for rich people. Before they were press-ganged into service as tools of war, they were used either in aerobatic displays or in races where a group of operators would compete in flying through an obstacle course. In either case, the drones were not meant to be easy to fly. They were meant to be highly maneuverable, but also unstable. First-person view drones cannot really hover, fly slowly, or linger above a target. The assumption among hobbyists is that enthusiasts will invest the time and money to become proficient at flying. As a result, training a highly proficient operator can take months. A standard, base-level course for Ukrainian drone pilots takes about five weeks. The quality of operators it prepares is questionable, and graduates of the course need extra on-the-job experience to become truly proficient. Most drone pilots I encountered did not go through this course. Instead, they learned to fly drones on the job. Even experienced operators routinely miss their targets and crash into trees, power lines, or other obstacles. To keep costs down, the first-person view drones used by Ukrainian forces have no navigational aids, such as a compass, a GPS receiver (though it should be noted that using GPS often would not be possible anyway due to widespread GPS signal jamming), or an inertial navigation system. The operator relies on their knowledge of the local terrain and on verbal instructions from a navigator, who usually has access to the video from the first-person view drone itself and from other reconnaissance assets that are tracking the target. But the greatest obstacle to the successful use of these drones by far is the unreliability of the radio link between the operator and the drone. One of the reasons why hitting a target at ground level with precision is difficult is that when first-person view drones get close to the ground, due to obstacles, they start to lose their radio connection to the operator, often located up to 10 kilometers away. In some cases, drones cannot attack a target if it is simply on the wrong side of a tall building or hill because the building or hill blocks the line of sight between the drone and the operator. Sometimes, the operator can work around the loss of signal close to the ground by climbing, pointing the drone at the target, and hoping inertia will take it to its target once they have lost control. When striking a small target like a doorway, a window, or the entrance to a basement, this degrades precision significantly. Drones also operate in a cluttered segment of the electromagnetic spectrum. First-person view drones use unencrypted analog radio signals, and in hot parts of the front, as many as a dozen drone teams may be competing for use of a handful of frequencies (a consequence of using cheaper components). This results in the need for sophisticated de-confliction procedures that, quite simply, do not always work. Even when de-confliction works, sometimes a team must wait as long as half an hour for a frequency to become available before takeoff. If it does not work and two drones find themselves in the air on the same channel at the same time, they will interfere with each other’s signals, usually resulting in a crash. On top of that, the enemy’s drones also fly on the same frequencies, which can also result in interference and a crash. Interference from another drone, whether friendly or hostile, resulted in the failure of at least three percent of our missions. In addition to interference and the physical limitations of radio communication, first-person view drones are also highly susceptible to electronic-warfare jamming. Both sides of the Russo-Ukrainian War make extensive use of jamming. When our side turned on its jammers, they usually informed us in advance. That meant our drones simply could not take off, sometimes for a period of several hours. About three percent of our sorties failed because we did not get advanced warning that our own jamming systems would be operational, causing our drones to fall out of the sky. On top of that, sometimes, even the best efforts at de-confliction were not enough, simply because Ukrainian infantry or individual vehicles are often equipped with small portable jammers. When they heard a drone, they simply activated the jammer without waiting to find out whether the drone was friendly or not. Of course, when the other side activated its jammers, we got no advance warning whatsoever. Enemy electronic warfare downed a full 31 percent of our sorties. This number could have been lower, but for our command’s occasional stubborn insistence that we fly even though it was almost certain that enemy jammers were operating in the target area. When enemy jammers were operating, the enemy’s own drones also could not fly, putting them in the same dilemma that our side also suffered. Nevertheless, when jammers were available and switched on, first-person view operations became effectively impossible. Some of the problems with first-person view drones will eventually be resolved as technology matures. Better production standards will ensure that a larger percentage of drones actually take off. In Ukraine, there are countless assembly lines that build drones from cheap, off-the-shelf components sourced from dubious suppliers. A single unit often sources its drones from numerous organizations, each with its own production processes. More standardization, better quality control, and less reliance on cheap components could improve reliability. Better transmitters and receivers that are more resistant to interference will improve the connection between drone and operator. Digital signal transmission and frequency hopping are starting to appear in some first-person view drones, though these are still rare. Putting re-translators that amplify the drone’s signal on a second drone that hovers somewhere between the operator and the first-person view drone can also improve the quality of the connection. Improved and standardized procedures for training operators would cut down the time needed to become proficient. To be sure, the technology has already evolved since I left the battlefield. Today, some Ukrainian and Russian units are also using drones controlled by fiber-optic cable, rather than radio, though I had no personal experience with this type of drone in my unit. This technology is often touted as the next step in the evolution of drone warfare. It would seem to address some of the major problems with radio-controlled drones I experienced, and compared to radio-controlled drones, fiber-optic drones may indeed have a number of advantages. Fiber optics make jamming impossible and deconflicting frequencies unnecessary. The absence of an energy-guzzling radio transmitter can extend battery life and even allow for some innovative tactics, such as landing the drone next to a road and waiting for several hours until a vehicle passes by. Fiber optic drones do, however, have a number of drawbacks that mean they might not fully replace radio-controlled drones. The wire that connects the drone to the operator limits the maneuverability of the drone. Snagging it on any kind of obstacle can result in a loss of control . Fiber-optic drones cannot really double back over their route or circle a target, as this could tangle their control wire and also result in a loss of control. As a result, fiber-optic drones are said to be even more difficult to fly than radio-controlled drones. Because of these limitations, several drone operators I spoke to actively resist using fiber-optic drones. Furthermore, though cost will probably come down, at present the cost of the cable means that a fiber-optic drone with 10 kilometers of cable costs about twice as much as a radio-controlled model of similar range. Finally, production capacities available to Ukraine for fiber-optic cables are, at present, fairly limited compared to radio-controlled drones, meaning they are chronically in short supply. All that said, if a member of a NATO military were hypothetically to ask me whether NATO countries should acquire first-person view drone capabilities, based on my experience and given the current state of the technology, I would probably say no, whether they are radio-controlled or fiber-optic. The vast majority of first-person view drone missions can be completed more cheaply, effectively, or reliably by other assets. Furthermore, other authors have noted that drones still do not come close to matching the effects that can be achieved by massed artillery fires. Additionally, experts on artillery systems consistently note the greater reliability and range of artillery. Scaling up drone use would also involve scaling up the drones’ logistical tail. This means more complicated and expensive logistics for drones that would compete for resources with other types of weapons. For the time being, first-person view drones are unlikely to fully replace other weapons systems. No military leader is yet seriously advocating doing away with artillery completely in favor of first-person view drones. This means that the military will have two competing logistical tails: one for first-person view drones and one for artillery. For sophisticated NATO militaries, instead of investing heavily in the development of first-person view drone capabilities, I would, first of all, recommend ensuring that troops in the field have well-trained organic mortar support with an ample supply of ammunition. Mortars, like artillery, can’t be stopped by bad weather, jamming, or crowded frequencies. Nor can they be impeded by the dark. A well-trained mortar crew can reliably put rounds on a target in less than five minutes. Our first-person view sorties took about 15 minutes from the initial request to the moment the drone struck the target, and that was only when conditions were optimal. A mortar’s price per shot is lower than a first-person view drone. Drones can nominally have an advantage over mortars in range, but this is variable and depends on the terrain, the specific location of the mortars relative to the drone launch site, and the deployment of intelligence, surveillance, and reconnaissance assets that find the targets for drones or mortars. In practice, I don’t remember a single case when we struck a target that was beyond the range of mortars, and we certainly never struck a target that was beyond the range of artillery. Secondly, for the rare cases when troops actually need tactical-level, organic precision-strike capability, and when actually carrying out such a strike is feasible, I would recommend something a little bit more high-end than a first-person view drone. NATO countries and their allies already produce high-quality loitering munitions, like the Switchblade. Such loitering munitions provide greater precision in day and night, more ease of use, and higher resistance to electronic interference than first-person view drones. They are also more expensive, but their cost is, like first-person view drones, coming down. The investment in quality seems to justify the greater expense, especially since, at most, one in ten first-person view sorties is a precision strike. BECOME A MEMBER Jakub Jajcay is a former officer in the Armed Forces of the Slovak Republic, where he served in a number of elite units. He is currently working on his Ph.D. in the Department of Middle Eastern Studies of Charles University in Prague. Image: Ukrainian Ministry of Defense photo by Vitaliy Pavlenko Get the Briefing from Those Who've Been There",
  "tiktok_summary": "Someone just raised $100 million for the most unexpected thing: a private army of AI-powered drones. But what does this mean for national security? The author of the recent article \"I Fought in Ukraine and Here's Why FPV Drones Kind of Suck\" has a unique perspective on this topic. As someone who served on the front lines, they've seen firsthand the impact of these drones on modern warfare. According to the writer, first-person view attack drones are supposed to revolutionize the battlefield, but in reality, they're more of a mixed bag. The author claims that these drones are often overhyped and underperforming. They're expensive, difficult to control, and sometimes even more of a liability than an asset. But what exactly makes them so flawed? The answer lies in their design. These drones have four propellers at the four corners of the craft, which creates a blind spot right behind the camera. It's like trying to navigate through a war zone with a camera crew attached to your head. But here's the part that'll blow your mind: did you know that some countries are already using drones to transport small arms and ammunition into conflict zones? That's right, these drones can carry heavy payloads, making them potentially game-changers in certain situations. However, the author notes that this also increases the risk of escalation and unintended consequences. Wait, what? How can we trust these drones not to fall into the wrong hands? The author highlights concerns about the potential for drones to be hacked or used as projectiles.",
  "summary_length": 1549,
  "summary_words": 256,
  "summarized_at": "2025-06-28T00:42:26.646017"
}