{
  "url": "https://www.cnbc.com/2025/06/20/meta-essilorluxottica-oakley-smart-glasses-hstn.html?utm_source=tldrnewsletter",
  "title": "Meta, EssilorLuxottica unveil Oakley smart glasses",
  "original_content": "Key Points The Oakley Meta HSTN glasses are the latest chapter of a multiyear partnership between Meta and EssilorLuxottica. The new glasses are pitched toward athletes and have a starting price of $399. CNBC reported Tuesday that Meta and EssilorLuxottica are also planning to release AI-powered smart glasses under the Prada brand. In this article EL-FR META Follow your favorite stocks CREATE FREE ACCOUNT Source: Meta Meta and EssilorLuxottica on Friday unveiled a new line of Oakley smart glasses that include the social media company's artificial intelligence assistant. The Oakley Meta HSTN, as the glasses are known, is the latest product borne from a multiyear partnership between the two companies. The HSTN smart glasses – which are pronounced how-stun – are pitched toward athletes and have a starting price of $399. The glasses represent Meta and Luxottica's first expansion of their smart glasses beyond the Ray-Ban brand. The companies released their first set of smart glasses in 2021, and they found a surprise success in the second generation of the device , which debuted in 2023. CNBC reported Tuesday that Meta was planning to release versions of its smart glasses under the Oakley and Prada brands. It's unclear when Meta's Prada deal and ensuing product line will be announced. Meta said its latest smart glasses contain Oakley's so-called PRIZM Lens technology, which are designed to help athletes see better \"across changing light and weather conditions.\" The Oakley Meta HSTN has a longer battery life and improved camera compared with the second-generation Ray-Ban Meta, which has a starting price of $299. Source: Meta Like the Ray-Ban Meta glasses, the HSTN glasses use the Meta AI digital assistant and a corresponding smartphone app so users can ask questions about the weather or tell the device to record videos of their activities. Some of the Oakley Meta HSTN's various frame-and-lens color combinations include a gray variant with red lenses and a black model with black lenses. The gadget is also water resistant, the companies said. A limited-edition version of the HSTN glasses with gold lenses and accents will cost $499 and be available to preorder on July 11. The standard Oakley Meta HSTN will go on sale later this summer. Other tech companies like Alphabet and Snap are also developing smart glasses. In May, Alphabet announced a $150 million partnership with Warby Parker to develop smart glasses that rely on Google's Gemini AI assistant, while Snap this month said it would unveil its sixth-generation augmented reality smart glasses next year. Don’t miss these insights from CNBC PRO Berkshire shares drop double digits as 'Buffett premium' disappears, and some expect more selling Goldman says 'TINA trade' is alive and well, fueled by 401(k) buying Best stocks: Defense, including these 2 names, may be in secular bull market as global conflicts mount Goldman Sachs says buy these five stocks that are set to rally WATCH : The Altman and Zuckerberg feud . watch now VIDEO 2:20 02:20 Zuckerberg, Altman feud for top AI talent TechCheck",
  "tiktok_summary": "BREAKING: Meta, EssilorLuxottica unveil Oakley smart glasses! This is a test summary for dry run mode. #TechNews #AI #TikTok",
  "summary_length": 124,
  "summary_words": 19,
  "summarized_at": "2025-06-28T20:07:51.279225"
}