{
  "url": "https://www.theregister.com/2025/06/24/vera_galaxy_camera/?utm_source=tldrnewsletter",
  "title": "World's largest camera shows galaxy in 3,200 megapixel glory as Rubin telescope goes online",
  "original_content": "Science 23 World's largest camera shows galaxy in 3,200 megapixel glory as Rubin telescope goes online 23 20TB of galactic shots a day, backed by Microsofties Iain Thomson Tue 24 Jun 2025 // 12:32 UTC High on a Chilean mountain the Vera C. Rubin Observatory is, at last, photographing the galaxy and the first shots have found 2,104 new asteroids in the Solar System in its initial ten hours of operation. \"Building the world's largest digital camera will allow scientists to explore the cosmos in new ways and at a scale that will enable discoveries that should fundamentally change our understanding of the universe,\" said Aaron Roodman, deputy director of the Rubin Construction. \"Just like you would with the camera on your phone, the time has finally come to point and take pictures – our science begins now.\" The first pictures released show 10 million galaxies. It's a small start, just 0.05 percent of the overall mission to map out almost 20 billion galaxies in the future. By taking a regular survey the telescope will seek to find the elements of dark matter and dark energy that make up our universe. Youtube Video The observatory is sited on the El Peñón peak of Cerro Pachón, a 2,682-meter-high (8,799 ft) mountain in the Chilean Andes, a popular location for space research as light pollution and atmospheric moisture – which affect optical instruments – are low. Over the next ten years astronomers are going to take snapshots of the Southern hemisphere in a detailed view of our closest neighbors, but also of nearby galaxies to give a better understanding of our place in the universe, taking more images in its first year than all the optical images of Earth-bound telescopes combined. The camera in the instrument weighs 2,800 kilograms (6,200 pounds) and can take in a massive amount of night sky. The instrument, as we've reported previously, received clearance ten years ago from the US Department of Energy's SLAC National Accelerator Lab and its National Science Foundation (NSF) and the Department of Energy's Office of Science. It is finally up and running now, scanning the skies to build up a history of celestial movements across the cosmos. This will help us both navigate near threats, such as asteroids, but also map stars for navigation. The Trifid Nebula and the Lagoon Nebula - thousands of light years away but visually close – Source: NSF–DOE Vera C. Rubin Observatory \"The release of our first scientific images marks an extraordinary milestone for Rubin Observatory. It represents the culmination of nearly two decades of dedication, innovation, and collaboration by a global team,\" said Rubin Observatory Construction director Željko Ivezić. \"With construction now complete, we fully turn our eyes to the skies, not just to take images, but to usher in a whole new era of discovery.\" The observatory, first called the Large Synoptic Survey Telescope but renamed to the Vera C. Rubin Observatory in honor of the first person to postulate the existence of dark matter, has survived the budget culls that have hurt space science. It was partially funded by Microsoft maven Charles Simonyi, for whom the main telescope is named, who put in $20 million in funding, backed by another $10 million from Bill Gates. All pixels go: World's biggest sky-gazing camera gets final sign-off 3.2 billion pixel sky-watcher a step closer Boffins build world's largest astronomical digital camera to map the heavens Vera Rubin earned a degree in astronomy in 1948 but was rejected from Princeton on the grounds that she was a woman. Harvard offered her a place instead but Rubin took up a position at Cornell University and studied galactic structures. She later served at Palomar Observatory, despite being told that there were no women's facilities at the time - 1965. She went ahead and used the men's anyway, putting up a paper skirt on the door to show it was unisex. Taking such a detailed map of the galaxy is key to understanding the effects of dark matter and dark energy, which constitutes so much of the known universe yet is hard to find. By mapping the stars, astronomers hope to find the keys to understanding how galaxies work. The Rubin Observatory \"is an investment in our future, laying a cornerstone of knowledge today upon which our children will proudly build tomorrow,\" said White House Office of Science and Technology policy director Michael Kratsios. ® Get our Tech Resources Share More about Microsoft NASA Space More like these × More about Microsoft NASA Space Narrower topics Active Directory Artemis Asteroid Astronomy Azure Bing Black Hole BSoD CSA Earth ESA Excel Exchange Server Exomoon Exoplanet Galaxy HoloLens Hubble Space Telescope Internet Explorer ISRO ISS James Webb Space Telescope JAXA",
  "tiktok_summary": "BREAKING: World's largest camera shows galaxy in 3,200 megapixel glory as Rubin telescope goes online! This is a test summary for dry run mode. #TechNews #AI #TikTok",
  "summary_length": 165,
  "summary_words": 27,
  "summarized_at": "2025-06-28T20:07:51.273227"
}