{
  "url": "https://techcrunch.com/2025/06/23/databricks-perplexity-co-founder-pledges-100m-on-new-fund-for-ai-researchers/?utm_source=tldrai",
  "title": "Databricks and Perplexity Co-Founder Pledges $100M for AI Research",
  "original_content": "Andy Konwinski, computer scientist and co-founder of Databricks and Perplexity, announced Monday that his company, Laude, is forming a new AI research institute backed with $100 million of his own money. The Laude Institute functions less as an AI research lab and more like a fund looking to make investments structured similar to grants. In addition to Konwinski, the institute’s board includes UC Berkeley professor Dave Patterson (known for a string of award-winning research), Jeff Dean (known as Google’s chief scientist), and Joelle Pineau (Meta’s vice president of AI Research). Konwinski announced the institute’s first and “flagship” grant of $3 million annually for five years, which will anchor the new AI Systems Lab at UC Berkeley. This is a new lab led by one of Berkeley’s most celebrated researchers, Ion Stoica, current director of the Sky Computing Lab. Stoica is also a co-founder of startup Anyscale (an AI and Python platform) and AI big data company Databricks, both built from tech developed in Berkeley’s lab system. The new AI Systems Lab is set to open in 2027 and in addition to Stoica will include a number of other well-known researchers. In his blog post announcing the institute, Konwinski described its mission as ”built by and for computer science researchers … We exist to catalyze work that doesn’t just push the field forward but guides it towards more beneficial outcomes.” That’s not necessarily a direct dig at OpenAI, which started out as an AI research facility and is now, arguably, consumed by its enormous commercial side. But other researchers have fallen prey to the lure of money as well. For instance, popular AI researcher Epoch faced controversy when it revealed that OpenAI supported the creation of one of its AI benchmarks that was then used to unveil its new o3 model. Epoch’s founder also launched a startup with the controversial mission to replace all human workers everywhere with AI agents. Techcrunch event Save $200+ on your TechCrunch All Stage pass Build smarter. Scale faster. Connect deeper. Join visionaries from Precursor Ventures, NEA, Index Ventures, Underscore VC, and beyond for a day packed with strategies, workshops, and meaningful connections. Save $200+ on your TechCrunch All Stage pass Build smarter. Scale faster. Connect deeper. Join visionaries from Precursor Ventures, NEA, Index Ventures, Underscore VC, and beyond for a day packed with strategies, workshops, and meaningful connections. Boston, MA | July 15 REGISTER NOW Like other AI research organizations with commercial ambitions, Konwinski has structured his institute across boundaries: as a nonprofit with a public benefit corporation operating arm. He’s dividing his research investments into two buckets that he calls “Slingshots and Moonshots.” Slingshots are for early-stage research that can benefit from grants and hands-on help. Moonshots are, as the name implies, for “long-horizon labs tackling species-level challenges like AI for scientific discovery, civic discourse, healthcare, and workforce re-skilling.” His lab has, for instance, collaborated with “terminal-bench,” a Stanford-led benchmark for how well AI agents handle tasks, used by Anthropic. One thing to note, Konwinski’s endeavors under the name “Laude” aren’t solely a grant-writing research institute. He also co-founded a for-profit venture fund launched in 2024. The fund’s co-founder is former NEA VC Pete Sonsini, and a Laude spokesperson tells us it has more than 50 leading researchers as LPs in the fund. As TechCrunch previously reported, Laude led a $12 million investment in AI agent infrastructure startup Arcade. It has quietly backed other startups, too. A Laude spokesperson tells us that while Konwinski has pledged $100 million, he’s also looking for, and open to, investment from other successful technologists. As to how Konwinski amassed a fortune big enough to guarantee $100 million for this new endeavor: Databricks closed a $15.3 billion funding round in January that valued the company at $62 billion. Perplexity last month secured a $14 billion valuation, too. Does the world really need yet more AI “good for humanity” research or another AI company with a murky nonprofit/commercial structure? No, and yes. AI research has become increasingly muddled . For instance, AI benchmarks designed to prove that a particular vendor’s model works best have become plentiful these days. (Even Salesforce has its own LLM benchmark for CRMs .) An alliance that includes the likes of Konwinski, Dean, and Stoica supporting truly independent research that could one day turn into independent and human-helpful commerce could be an attractive alternative. Note: This story was updated to reflect more details shared about the Laude VC fund.",
  "tiktok_summary": "BREAKING: Databricks and Perplexity Co-Founder Pledges $100M for AI Research! This is a test summary for dry run mode. #TechNews #AI #TikTok",
  "summary_length": 140,
  "summary_words": 22,
  "summarized_at": "2025-06-28T20:07:51.303224"
}