{
  "url": "https://www.macrumors.com/2025/06/23/apple-to-announce-more-eu-app-store-concessions/?utm_source=tldrnewsletter",
  "title": "Apple to Announce More App Store Concessions for the EU",
  "original_content": "Report: Apple to Announce More App Store Concessions for the EU Monday June 23, 2025 6:15 am PDT by Hartley Charlton Apple is engaged in eleventh-hour negotiations with European Union regulators in an effort to delay or avoid a new wave of financial penalties stemming from noncompliance with the bloc's Digital Markets Act (DMA), the Financial Times reports. The company is under pressure to make significant changes to its App Store policies in the European Union after being fined €500 million earlier this year for preventing developers from directing users to alternative purchasing options outside of Apple's in-app payment system. That practice, referred to by regulators as \"anti-steering,\" is explicitly prohibited under the DMA, which came into effect for designated gatekeepers, including Apple, in March 2024. People involved in the discussions told the Financial Times that Apple is preparing to offer new concessions ahead of a Thursday, June 26 deadline, after which the European Commission is empowered to impose escalating daily fines of up to 5% of Apple's average global turnover. Based on Apple's 2023 revenue of $383 billion, such fines could amount to more than $50 million per day. Apple's expected concessions will primarily relate to its steering rules, which have previously required developers to use Apple's payment infrastructure and prohibited them from linking users to external purchasing platforms. The upcoming proposals may ease those restrictions. Apple introduced a new framework for alternative app marketplaces in the EU in iOS 17.4, which went into effect in March. The update allows developers to distribute apps through third-party app stores and to use alternative payment methods within their own apps. However, some major developers and the European Commission itself argue that the changes do not go far enough to satisfy the requirements of the DMA. In particular, attention has focused on the Core Technology Fee (CTF), a charge of €0.50 per annual install on apps distributed outside the ‌App Store‌ after the first one million downloads. Sources cited by the Financial Times said the Core Technology Fee has also been part of the recent discussions between Apple and the European Commission. Note: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our Political News forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts. Tags: European Union , Financial Times [ 189 comments ] Get weekly top MacRumors stories in your inbox. Popular Stories Tuesday June 24, 2025 3:40 am PDT by Tim Hardwick Apple will finally deliver the Apple Watch Ultra 3 sometime this year, according to analyst Jeff Pu of GF Securities Hong Kong (via @jukanlosreve). The analyst expects both the Apple Watch Series 11 and Apple Watch Ultra 3 to arrive this year (likely alongside the new iPhone 17 lineup, if previous launches are anything to go by), according to his latest product roadmap shared with... • 127 comments Wednesday June 25, 2025 5:03 am PDT by Tim Hardwick Apple is facing mounting resistance from automakers over CarPlay Ultra, the next-generation version of its CarPlay software system for vehicles that was announced last month. A new (paywalled) Financial Times report claims several major brands are walking back their earlier commitments to support the upgraded dashboard software. German luxury manufacturers Mercedes-Benz and Audi have both... • 275 comments Monday June 23, 2025 2:57 pm PDT by Juli Clover Apple provided developers with the second beta of iOS 26, introducing the first changes and refinements to the new operating system since it debuted after the WWDC keynote. Because we're early in the beta testing process, there are quite a few tweaks to iOS 26, which we've rounded up below.",
  "tiktok_summary": "BREAKING: Apple to Announce More App Store Concessions for the EU! This is a test summary for dry run mode. #TechNews #AI #TikTok",
  "summary_length": 129,
  "summary_words": 23,
  "summarized_at": "2025-06-28T20:07:51.279225"
}