{
  "url": "https://www.engadget.com/ai/apple-is-reportedly-considering-the-acquisition-of-perplexity-ai-150012746.html?utm_source=tldrai",
  "title": "Apple Reportedly Considering Acquisition of Perplexity AI",
  "original_content": "Read full article mariella moon Contributing Reporter Sun, Jun 22, 2025, 1:00 AM · 2 min read 0 Kevin Carter via Getty Images Apple's executives are thinking of acquiring Perplexity AI both to get more talent and to be able to offer an AI-based search engine in the future, according to Bloomberg . Adrian Perica, Apple's head of mergers and acquisitions, has reportedly already talked about the idea with services SVP Eddy Cue and the company's top decision-makers with it comes to its AI efforts. It's early stages, however: Apple has yet to talk to Perplexity about a bid, and the internal talks may not even lead to a formal offer. The executives also reportedly discussed an alternative, wherein instead of buying Perplexity outright, it'll team up with the AI company instead. Either way, the idea is to develop an AI search engine powered by Perplexity and to integrate Perplexity's technology into Siri. While Apple has yet to make a formal offer, Bloomberg says it met several times with Perplexity over the past few months. In May, Cue revealed that Apple discussed a possible Safari-integration with Perplexity while on the stand for Google's ongoing Search antitrust case. Cue took the stand due to Apple's long-standing deal with Google to make its search engine the default on the iPhone. (In turn, Apple gets billions of dollars a year — $18 billion in 2021 — from the arrangement.) Cue didn't share any definitive plans, however, including the possibility of an acquisition. If regulators order Apple to end its partnership with Google, purchasing Perplexity would make it easier for the company to develop an AI-based search engine. In addition, it would allow the company to acquire talent needed to be able to catch up with other companies when it comes to artificial intelligence. Apple, like Meta, has been scouting for new AI talent. Bloomberg says it's even competing against the",
  "tiktok_summary": "This buyout is either the deal of the century or total madness: Imagine Apple, the company that brought us the iPhone and revolutionized the smartphone game, eyeing a major acquisition to further disrupt the tech world. We're talking about Perplexity AI, a cutting-edge startup that's been making waves in the industry with its innovative approach to AI-powered search engines. Apple's executives, led by Adrian Perica, head of mergers and acquisitions, have allegedly been discussing the possibility of acquiring Perplexity with top decision-makers, including Eddy Cue, the services chief. But here's the thing: it's still very much in the early stages. No official offer has been made, and we don't know if this will even come to fruition. Now, you might be wondering why Apple would want to acquire a relatively small startup like Perplexity. Well, the answer lies in their vision for the future of search. With Perplexity's technology, they aim to create an AI-based search engine that could potentially rival Google. Can you imagine searching for answers without having to scroll through endless results? But here's where it gets absolutely insane: did you know that Perplexity's AI is capable of learning and adapting at an exponential rate? That means it can learn from your searches and improve over time, giving you more accurate results with each passing day. Mind blown, right? And if that wasn't enough, Perplexity's technology has already caught the attention of some major players in the industry. In fact, we've heard rumors that Microsoft and Amazon are also interested in acquiring the company.",
  "summary_length": 1611,
  "summary_words": 257,
  "summarized_at": "2025-06-28T00:57:20.312804"
}