{
  "url": "https://www.tomshardware.com/tech-industry/artificial-intelligence/trump-and-tsmc-pitched-usd1-trillion-ai-complex-softbank-founder-masayoshi-son-wants-to-turn-arizona-into-the-next-shenzhen?utm_source=tldrnewsletter",
  "title": "Trump and TSMC pitched $1 trillion AI complex",
  "original_content": "Skip to main content Recommended reading (Image credit: SoftBank) Masayoshi Son, founder of SoftBank Group, is working on plans to develop a giant AI and manufacturing industrial hub in Arizona, potentially costing up to $1 trillion if it reaches full scale, reports Bloomberg . The concept of what is internally called Project Crystal Land involves creating a complex for building artificial intelligence systems and robotics. Son has talked to TSMC, Samsung, and the Trump administration about the project. Masayoshi Son's Project Crystal Land aims to replicate the scale and integration of China’s Shenzhen by establishing a high-tech hub focused on manufacturing AI-powered industrial robots and advancing artificial intelligence technologies. The site would host factories operated by SoftBank-backed startups specializing in automation and robotics, Vision Fund portfolio companies (such as Agile Robots SE), and potentially involve major tech partners like TSMC and Samsung. If fully realized, the project could cost up to $1 trillion and is intended to position the U.S. as a leading center for AI and high-tech manufacturing. SoftBank is looking to include TSMC in the initiative, given its role in fabricating Nvidia's AI processors. However, a Bloomberg source familiar with TSMC's internal thinking indicated that the company's current plan to invest $165 billion in total in its U.S. projects has no relation to SoftBank's projects. Samsung Electronics has also been approached about participating, the report says. Talks have been held with government officials to explore tax incentives for companies investing in the manufacturing hub. This includes communication with Commerce Secretary Howard Lutnick, according to Bloomberg. SoftBank is reportedly seeking support at both the federal and state levels, which could be crucial to the success of the project. The development is still in the early stages, and feasibility will depend on private sector interest and political support, sources familiar with SoftBank's plans told Bloomberg. To finance its Project Crystal Land, SoftBank is considering project-based financing structures typically used in large infrastructure developments like pipelines. This approach would enable fundraising on a per-project basis and reduce the amount of upfront capital required from SoftBank itself. A similar model is being explored for the Stargate AI data center initiative, which SoftBank is jointly pursuing with OpenAI, Oracle, and Abu Dhabi's MGX. Melissa Otto of Visible Alpha suggested in a Bloomberg interview that rather than spending heavily, Son might more efficiently support his AI project by fostering partnerships between manufacturers, AI engineers, and specialists in fields like medicine and robotics, and by backing smaller startups. However, she notes that investing in data centers could also reduce AI development costs and drive wider adoption, which would be good for the long term for AI in general and Crystal Land specifically. Nonetheless, it is still too early to judge the outcome. Stay On the Cutting Edge: Get the Tom's Hardware",
  "tiktok_summary": "Two giants just teamed up and it's game-changing: Masayoshi Son, the billionaire CEO of SoftBank, is cooking up a behemoth of an AI project that'll make your head spin. Imagine a $1 trillion complex that's like nothing we've ever seen before - and I'm not even kidding, it's massive! This isn't just some pie-in-the-sky idea, folks. SoftBank's got big-name backing, including talks with TSMC and the Trump administration. We're talking robotics, AI, and manufacturing on a scale that could rival China's Shenzhen - but with a twist: this is all happening right here in Arizona. Now, you might be thinking, \"Wait, why Arizona?\" Well, let me tell you, it's because Son wants to create a hub for automation and robotics that's gonna change the game. And it's not just startups and small players - we're talking Vision Fund portfolio companies like Agile Robots SE, and major tech partners like TSMC and Samsung are already on board. But here's the thing: this project's so big, it's almost... unhinged. We're talking factories, people! Not just any factories, but ones that will churn out AI-powered industrial robots at an unprecedented scale. And get this - Masayoshi Son's planning to spend upwards of $1 trillion to make it happen. That's a one-trillion-dollar question mark. What does this mean for us? It means we're looking at a future where AI is no longer just a buzzword - it's a reality. And if you thought the likes of Tesla and Google were pushing the boundaries, hold onto your hats, because SoftBank's about to take it to the next level.",
  "summary_length": 1549,
  "summary_words": 263,
  "summarized_at": "2025-06-28T00:48:22.546637"
}