{
  "url": "https://techcrunch.com/2025/06/26/why-a16z-vc-believes-that-cluely-the-cheat-on-everything-startup-is-the-new-blueprint-for-ai-startups/?utm_source=tldrai",
  "title": "Why a16z VC believes that Cluely, the ‘cheat on everything' startup, is the new blueprint for AI startups",
  "content": "When Cluely, a startup claiming to be building a product that helps people “cheat” on everything, announced that it raised a $15 million Series A financing round from Andreessen Horowitz, some people on X criticized the VC firm for backing the controversial company. After all, Cluely isn’t just offering a product that may have questionable uses; the startup has also become famous for using what many people call rage-bait marketing. But Cluely’s ability to grab attention is precisely what attracted a16z to the startup. Even before meeting Cluely’s founder Roy Lee, Andreessen Horowitz’s partner Bryan Kim thought that startups need new marketing tactics in the AI era. Kim, like many investors, previously thought that building a superb “artisan” product with highly desired features was the key to a startup’s lasting success, he explained on the latest a16z podcast episode . But shortly after the emergence of generative AI, he noticed that offering an exceptional product might not be enough. “If you craft this thing and OpenAI or someone builds a new model to include that part in their product, you’re done,” Kim said. “So, it couldn’t become this highly thoughtful, slow-build product. It needed to be something where founders moved extremely quickly.” Techcrunch event Save $200+ on your TechCrunch All Stage pass Build smarter. Scale faster. Connect deeper. Join visionaries from Precursor Ventures, NEA, Index Ventures, Underscore VC, and beyond for a day packed with strategies, workshops, and meaningful connections. Save $200+ on your TechCrunch All Stage pass Build smarter. Scale faster. Connect deeper. Join visionaries from Precursor Ventures, NEA, Index Ventures, Underscore VC, and beyond for a day packed with strategies, workshops, and meaningful connections. Boston, MA | July 15 REGISTER NOW That realization has led Kim to believe that speed, whether in marketing or product building, is paramount to creating a successful startup. Earlier this month, Kim published a post explaining his theory of why, for consumer-facing AI startups, “momentum is the moat.” When Kim met Lee and saw that Cluely had been able to convert awareness into paying customers, he instantly knew that he had discovered a founder he had theorized about. “It’s been so hard to pierce through the noise of everything AI, especially in consumer, and to do that consistently is actually near impossible,” Kim said. How does Lee explain why his polarizing marketing approach has generated so much buzz? “Most people don’t know how to make viral content,” Lee said on the podcast. “Everyone on X is trying to [sound] like the most intellectual, thoughtful person. But this just lacks viral sense.” Lee, instead, had studied why some posts on TikTok and",
  "published_date": "2025-06-27 00:00:00",
  "category": "big_tech",
  "word_count": 438,
  "content_extraction_status": "success",
  "failure_reason": null,
  "feed_name": "TLDR AI",
  "scraped_at": "2025-06-28T00:42:10.604595"
}