{
  "url": "https://www.nytimes.com/2025/06/26/technology/uber-travis-kalanick-self-driving-car-deal.html?unlocked_article_code=1.SE8.RxjG.-FBm6aDl5I5P&smid=url-share&utm_source=tldrnewsletter",
  "title": "Uber in Talks With Its Founder, Travis Kalanick, to Fund Self-Driving Car Deal",
  "content": "Uber in Talks With Travis Kalanick to Fund Self-Driving Car Deal - The New York Times Technology | Uber in Talks With Its Founder, Travis Kalanick, to Fund Self-Driving Car Deal https://www.nytimes.com/2025/06/26/technology/uber-travis-kalanick-self-driving-car-deal.html Share full article 12 Advertisement SKIP ADVERTISEMENT You have a preview view of this article while we are checking your access. When we have confirmed access, the full article content will load. Uber is increasingly grappling with competition from self-driving taxi services like Waymo. Now the ride-hailing giant is taking more action to deal with that threat. Uber is in talks with Travis Kalanick , the company’s co-founder who was forced out in a boardroom coup eight years ago this month, to help fund his acquisition of the U.S. subsidiary of a Chinese autonomous vehicle company, two people with knowledge of the matter said. The company, Pony.ai, was founded in Silicon Valley in 2016 but has its main presence in China, and has permits to operate robot taxis and trucks in the United States and China. The talks are preliminary, said the people, who were not authorized to speak about the confidential conversations. Mr. Kalanick will run Pony if the deal is completed, they said. It is unclear what role, if any, Uber would take in Pony as an investor. Financial details of the potential transaction could not be determined. Pony went public last year in the United States, raising $260 million in a share sale. Its market capitalization stands around $4.5 billion. If the deal goes through, Mr. Kalanick, 48, will remain in his day job running CloudKitchens , a virtual restaurant start-up that he founded after leaving Uber in 2017. He would also work more closely with Dara Khosrowshahi, who took over as Uber’s chief executive after Mr. Kalanick’s ouster. The discussions are the starkest sign yet that Uber is under pressure from Waymo, the driverless car unit spun out of Google, and other autonomous car services. This month, Tesla also unveiled a limited robot taxi service in Austin, Texas. Over time, these autonomous vehicle services may replace or eat into rides from human drivers. In cities like San Francisco, where robot taxi services are available, the vehicles have become ubiquitous and are popular. We are having trouble retrieving the article content. Please enable JavaScript in your browser settings. Thank you for your patience while we verify access. If you are in Reader mode please exit and log into your Times account, or",
  "published_date": "2025-06-27 00:00:00",
  "category": "ai",
  "word_count": 407,
  "content_extraction_status": "partial",
  "failure_reason": "Partial extraction: got 407/1000 words (40.7%)",
  "feed_name": "TLDR Tech",
  "scraped_at": "2025-06-28T00:42:10.562557"
}