{
  "url": "https://analyticsindiamag.com/ai-news-updates/muratis-startup-bets-on-rl-for-business-after-raising-2-bn/?utm_source=tldrnewsletter",
  "title": "Murati's Startup Bets on ‘RL for Business' After Raising $2 Bn",
  "content": "Published on June 25, 2025 In AI News Murati’s Startup Bets on ‘RL for Business’ After Raising $2 Bn TML is expected to offer AI solutions for industries like customer support, retail, and investment banking. by Aditi Suresh Thinking Machines Lab (TML), the AI startup founded by former OpenAI CTO Mira Murati, has finally offered a glimpse into its strategy. The company has raised $2 billion at a $10 billion valuation from investment firm Andreessen Horowitz (a16z) in just under five months, The Information reported. TML has revealed that its focus is on creating custom AI solutions designed to help businesses increase revenue. Investors have described TML’s business model as “RL for businesses”, reflecting the startup’s emphasis on tailoring AI to business-specific metrics and needs. A confirmation from Murati on the specific details is awaited. However, TML is reportedly expected to provide AI solutions tailored to specific industries, such as customer support, retail, and investment banking. The company may charge a premium for these highly customised models. While TML’s business focus is on enterprise AI, the startup also plans to develop a consumer-facing product. Details about the product remain unclear, but one idea that was previously discussed involved creating a chatbot to compete with OpenAI’s ChatGPT. The report also suggested that TML rents powerful NVIDIA servers through Google Cloud, a partnership that could position Google as a major benefactor should TML’s business grow. Other cloud providers, including Amazon, are also reportedly eager to collaborate with the startup, having met with Murati to explore potential opportunities. TML, in its launch blog post , revealed that the startup has hired top-tier AI researchers and engineers from leading companies such as OpenAI and Anthropic. When Murati left OpenAI and founded Thinking Machine Labs, she brought around 20 OpenAI employees with her and later expanded the team to 60 by hiring from OpenAI and other AI labs. The company’s growing talent pool makes it an attractive acquisition target. We have written extensively on how AI talent is the new compute. Meta CEO Mark Zuckerberg has reportedly discussed the possibility of investing in or acquiring TML, though talks have not progressed beyond the preliminary stage. Moreover, Zuckerberg’s team reportedly made an acquisition offer for Safe Superintelligence (SSI) , the AI startup co-founded by former OpenAI chief scientist Ilya Sutskever. During its fundraising efforts, the startup had reportedly been valued at around $32 billion. However, the offer was declined. Yet, Meta is trying to hire SSI co-founder Daniel Gross and former GitHub CEO Nat Friedman to strengthen its new AI division, which is headed by Wang . 📣 Want to advertise in AIM? Book here Aditi Suresh I hold a degree in political science, and am interested in how AI and online culture intersect. I am at aditi.suresh@analyticsindiamag.com & x.com/aditisuresh12 Related Posts The Air India Tragedy That Could Have Been Prevented by AI OpenAI Appoints Instacart CEO Fidji Simo to Lead New Applications Division Build AI to Boost Human Capabilities, Not Replace Them, Says Google DeepMind Executive ‘AI Platforms will Control What Everybody Sees,’ Says Meta’s AI Chief Yann LeCun Now There Is An Olympics Pitching AI Against Animals Dream 11 Is Upping The Fantasy Game Market With Its AI-Powered Platform Association of Data Scientists GenAI Corporate Training Programs Enquire Today >> Our Upcoming Conference Cypher 2025 India's Biggest AI Summit & Expo from the Heart of Bengaluru Sep 17 to 19, 2025 | 📍KTPO, Whitefield, Bengaluru, India Download the easiest way to stay informed India Builds for the World with AWS at the Centre By 2030, the company plans to invest $12.7 billion across its Mumbai and Hyderabad regions, contributing $23.3 billion to India’s GDP and supporting over 1.31 lakh full-time jobs annually. India’s Measured March Towards Agentic AI Gear Up for the Upcoming Snowflake GCC Forums 2025 Latest AI News 92% of Indian Employees Embrace GenAI at Work, Highest in the World Parliamentary Panel Highlights India’s Readiness Amid AI’s Emergence Former ISRO Chairman Joins Skyroot Aerospace as Chief Technical Advisor NVIDIA H20 Chip Shortage Delays DeepSeek R2 Launch Investor With No Coding Experience Builds ‘$1.7Mn SaaS’ Using Replit DeepMind Launches AlphaGenome to Predict How DNA Variants Affect Gene Regulation The ‘Fastest Commercial-Grade’ Diffusion LLM is Available Now HCLTech, Salesforce Deepen Ties to Fast-track Agentic AI for Enterprises",
  "published_date": "2025-06-26 00:00:00",
  "category": "big_tech",
  "word_count": 713,
  "content_extraction_status": "success",
  "failure_reason": null,
  "feed_name": "TLDR Tech",
  "scraped_at": "2025-06-28T00:42:10.575561"
}