{
  "url": "https://developers.googleblog.com/en/imagen-4-now-available-in-the-gemini-api-and-google-ai-studio/?utm_source=tldrai",
  "title": "Google Launches Imagen 4",
  "content": "English Español (Latam) Bahasa Indonesia 日本語 한국어 Português (Brasil) 简体中文 Gemini / Google AI Studio Imagen 4 is now available in the Gemini API and Google AI Studio JUNE 24, 2025 Alisa Fortin Product Manager Guillaume Vernade Gemini Developer Advocate AI Studio Seth Odoom Product Manager We're thrilled to bring Imagen 4, our best text-to-image model yet , to paid preview in the Gemini API and for limited free testing in Google AI Studio . Imagen 4 offers significantly improved text rendering over our prior image models and pushes the boundaries of text-to-image generation quality. The Imagen 4 Family: Imagen 4 and Imagen 4 Ultra We’re introducing two models within the Imagen 4 family, built to serve a variety of creative needs: Imagen 4: Your go-to for most tasks This is our flagship text-to-image model designed to handle a wide range of image generation tasks with significant improvements in quality, particularly for text generation, over Imagen 3. Imagen 4 is priced at $0.04 per output image . Imagen 4 Ultra: Precision for your prompts When you need your images to precisely follow instructions, Imagen 4 Ultra is the model for you. It's designed to produce outputs that are more highly aligned with your text prompts, achieving strong results compared to other leading image generation models. Imagen 4 Ultra is priced at $0.06 per output image . We will introduce additional billing tiers in the coming weeks. In the meantime, you can request higher rate limits for Imagen 4 and 4 Ultra. See Imagen 4 in action To give you a glimpse of Imagen 4's capabilities, here are some examples of what you can create. Created using Imagen 4 Ultra, the prompts below showcase the model's versatility across various styles and content. Prompt: A 3-panel cosmic epic comic. Panel 1: Tiny 'Stardust' in nebula; radar shows anomaly (text 'ANOMALY DETECTED'), hull text 'stardust'. Pilot whispers. Panel 2: Bioluminescent leviathan emerges; console red text 'WARNING!. Panel 3: Leviathan chases ship through asteroids; console re text 'SHIELD CRITICAL!', screen text 'EVADE!'. Pilot screams, SFX 'CRUNCH!', 'ROOOOAAARR!'. Imagen 4 Ultra Prompt: Front of a vintage travel postcard for Kyoto: iconic pagoda under cherry blossoms, snow-capped mountains in distance, clear blue sky, vibrant colors. Imagen Ultra 4 Prompt: Photograph of an adventurous couple hiking on a mountain peak at sunrise, arms raised in triumph, epic panoramic view of valleys below, dramatic light. Imagen 4 Ultra Prompt: Avant-garde fashion editorial shot: a model in a voluminous, architectural gown standing on a shimmering, alien landscape under a binary sunset, surreal colors, high-concept, cinematic. Start building with Imagen To help maintain trust and transparency, all images generated by Imagen 4 models will continue to include a non-visible digital SynthID watermark. To get started, check out the official documentation and cookbooks: Read the documentation Imagen cookbooks We can't wait to see what you create with Imagen 4 through the Gemini API and Google AI Studio , and we look forward to making these models generally available in the coming weeks. posted in: Gemini Google AI Studio AI Announcements Gemini API Developer Tools Machine Learning DeepMind Imagen text-to-image text generation SynthID Previous Next Related Posts Gemini AI How-To Guides Simulating a neural operating system with Gemini 2.5 Flash-Lite JUNE 25, 2025 AI Cloud Case Studies How-To Guides Unlock deeper insights with the new Python client library for Data Commons JUNE 26, 2025 Gemini AI Announcements Supercharge your notebooks: The new AI-first Google Colab is now available to everyone JUNE 24, 2025 Gemma AI Announcements Introducing Gemma 3n: The developer guide JUNE 26, 2025",
  "published_date": "2025-06-25 00:00:00",
  "category": "ai",
  "word_count": 593,
  "content_extraction_status": "success",
  "failure_reason": null,
  "feed_name": "TLDR AI",
  "scraped_at": "2025-06-28T00:42:10.615118"
}