{
  "url": "https://techcrunch.com/2025/06/06/why-investing-in-growth-stage-ai-startups-is-getting-riskier-and-more-complicated/?utm_source=tldrai",
  "title": "Why investing in growth-stage AI startups is getting riskier and more complicated",
  "content": "Making a bet on AI startups has never been so exciting — or more risky. Incumbents like OpenAI, Microsoft, and Google are scaling their capabilities fast to swallow many of the offerings of smaller companies. At the same time, new startups are reaching the growth stage much faster than they historically have. But defining “growth stage” in AI startups is not so cut-and-dried today. Jill Chase, partner at CapitalG, said onstage at TechCrunch Sessions: AI on Thursday that she’s seeing more companies that are only a year old, yet have already reached tens of millions in annual recurring revenue and more than $1 billion in valuation. While those companies might be defined as mature due to their valuation and revenue generation, they often lack much of the necessary safety, hiring, and executive infrastructure. “On one hand, that’s really exciting. It represents this brand-new trend of extremely fast growth, which is awesome,” Chase said. “On the other hand, it’s a little bit scary because I’m gonna pay at an $X billion valuation for this company that didn’t exist 12 months ago, and things are changing so quickly.” “Who knows who is in a garage somewhere, maybe in this audience somewhere, starting a company that in 12 months will be a lot better than this one I’m investing in that’s at $50 million ARR today,” Chase continued. “So it’s made growth investing a little confusing.” To cut through the noise, Chase said it’s important for investors to feel good about the category and the “ability of the founder to very quickly adapt and see around corners.” She noted that AI coding startup Cursor is a great example of a company that “jumped on the exact right use case of AI code generation that was available and possible given the technology at the time.” Techcrunch event Save $200+ on your TechCrunch All Stage pass Build smarter. Scale faster. Connect deeper. Join visionaries from Precursor Ventures, NEA, Index Ventures, Underscore VC, and beyond for a day packed with strategies, workshops, and meaningful connections. Save $200+ on your TechCrunch All Stage pass Build smarter. Scale faster. Connect deeper. Join visionaries from Precursor Ventures, NEA, Index Ventures, Underscore VC, and beyond for a day packed with strategies, workshops, and meaningful connections. Boston, MA | July 15 REGISTER NOW However, Cursor will need to work to maintain its edge. “There will be, by the end of this year, AI software engineers,” Chase said. “In that scenario, what Cursor has today is going to be a little less relevant. It is incumbent on the Cursor team to see that future and to think, okay, how do I start building my product so that when those models come out and are much more powerful, the product surface represents those and I can very quickly plug those in and switch into that state of code generation?”",
  "published_date": "2025-06-23 00:00:00",
  "category": "big_tech",
  "word_count": 476,
  "content_extraction_status": "success",
  "failure_reason": null,
  "feed_name": "TLDR AI",
  "scraped_at": "2025-06-28T00:42:10.633119"
}