{
  "url": "https://www.engadget.com/ai/apple-is-reportedly-considering-the-acquisition-of-perplexity-ai-150012746.html?utm_source=tldrai",
  "title": "Apple Reportedly Considering Acquisition of Perplexity AI",
  "content": "Read full article mariella moon Contributing Reporter Sun, Jun 22, 2025, 1:00 AM · 2 min read 0 Kevin Carter via Getty Images Apple's executives are thinking of acquiring Perplexity AI both to get more talent and to be able to offer an AI-based search engine in the future, according to Bloomberg . Adrian Perica, Apple's head of mergers and acquisitions, has reportedly already talked about the idea with services SVP Eddy Cue and the company's top decision-makers with it comes to its AI efforts. It's early stages, however: Apple has yet to talk to Perplexity about a bid, and the internal talks may not even lead to a formal offer. The executives also reportedly discussed an alternative, wherein instead of buying Perplexity outright, it'll team up with the AI company instead. Either way, the idea is to develop an AI search engine powered by Perplexity and to integrate Perplexity's technology into Siri. While Apple has yet to make a formal offer, Bloomberg says it met several times with Perplexity over the past few months. In May, Cue revealed that Apple discussed a possible Safari-integration with Perplexity while on the stand for Google's ongoing Search antitrust case. Cue took the stand due to Apple's long-standing deal with Google to make its search engine the default on the iPhone. (In turn, Apple gets billions of dollars a year — $18 billion in 2021 — from the arrangement.) Cue didn't share any definitive plans, however, including the possibility of an acquisition. If regulators order Apple to end its partnership with Google, purchasing Perplexity would make it easier for the company to develop an AI-based search engine. In addition, it would allow the company to acquire talent needed to be able to catch up with other companies when it comes to artificial intelligence. Apple, like Meta, has been scouting for new AI talent. Bloomberg says it's even competing against the",
  "published_date": "2025-06-23 00:00:00",
  "category": "ai",
  "word_count": 317,
  "content_extraction_status": "success",
  "failure_reason": null,
  "feed_name": "TLDR AI",
  "scraped_at": "2025-06-28T00:42:10.634119"
}