{
  "url": "https://www.macrumors.com/2025/06/24/apple-wallet-notification-f1-movie-ad/?utm_source=tldrnewsletter",
  "title": "iPhone Users Upset About Apple Promoting F1 Movie With Wallet App Notification",
  "content": "iPhone Users Upset About Apple Promoting F1 Movie With Wallet App Notification Tuesday June 24, 2025 11:02 am PDT by Joe Rossignol Apple today sent out an ad to some iPhone users in the form of a Wallet app push notification, and not everyone is happy about it. An unknown number of iPhone users in the U.S. today received the push notification, which promotes a limited-time Apple Pay discount that movie ticket company Fandango is offering on a pair of tickets to Apple's new film \"F1: The Movie.\" Some of the iPhone users who received the push notification have complained about it across the MacRumors Forums , Reddit , X , and other online discussion platforms. \"As far as I can tell, Apple is now just sending me ads to my screen now as push notifications, something I hate with an absolute passion and disable across the board in every app that tries this,\" said one person who received the notification. Some people are especially upset about receiving a push notification ad through the Wallet app because it is a very important app for personal finances, so simply turning off notifications for the entire app is not a feasible solution. Worse, Apple seems to be ignoring the guidelines that apply to App Store apps. The company says push notifications should not be used for promotions or direct marketing purposes unless users have explicitly opted in to receive them for said purposes. The full text of Apple's guideline: Push Notifications should not be used for promotions or direct marketing purposes unless customers have explicitly opted in to receive them via consent language displayed in your app's UI, and you provide a method in your app for a user to opt out from receiving such messages. Apple did not immediately respond to our request for comment. Apple has been heavily promoting F1: The Movie, which debuts in theaters on June 25 in Europe and on June 27 in the U.S. and Canada. However, the company may have gone a step too far here based on online reaction from some iPhone users. One silver lining is that the iOS 26 beta adds an \"Offers & Promotions\" toggle to the Wallet app, allowing users to opt in or out of receiving special offers and discounts available from Apple and its unspecified partners. However, Apple sent out to the push notification ad to iPhone users on iOS 18 too, and those users seemingly did not explicitly opt in to receive such an ad. For that reason, some people are disappointed in Apple. Tag: Apple Wallet [ 260 comments ] Get weekly top MacRumors stories in your inbox. Popular Stories Tuesday June 24, 2025 3:40 am PDT by Tim Hardwick Apple will finally deliver the Apple Watch Ultra 3 sometime this year, according to analyst Jeff Pu of GF Securities Hong Kong (via @jukanlosreve). The analyst expects both the Apple Watch Series 11 and Apple Watch Ultra 3 to arrive this year (likely alongside the new iPhone 17 lineup, if previous launches are anything to go by), according to his latest product roadmap shared with... • 127 comments Wednesday June 25, 2025 5:03 am PDT by Tim Hardwick Apple is facing mounting resistance from automakers over CarPlay Ultra, the next-generation version of its CarPlay software system for vehicles that was announced last month. A new (paywalled) Financial Times report claims several major brands are walking back their earlier commitments to support the upgraded dashboard software. German luxury manufacturers Mercedes-Benz and Audi have both... • 273 comments Monday June 23, 2025 2:57 pm PDT by Juli Clover Apple provided developers with the second beta of iOS 26, introducing the first changes and refinements to the new operating system since it debuted after the WWDC keynote. Because we're early in the beta testing process, there are quite a few tweaks to iOS 26, which we've rounded up below.",
  "published_date": "2025-06-25 00:00:00",
  "category": "ai",
  "word_count": 650,
  "content_extraction_status": "success",
  "failure_reason": null,
  "feed_name": "TLDR Tech",
  "scraped_at": "2025-06-28T00:42:10.584558"
}