{
  "url": "https://www.npr.org/2025/06/25/nx-s1-5444796/axiom-space-ax-4-launch-iss?utm_source=tldrnewsletter",
  "title": "SpaceX launches 4 people into orbit on Axiom Space Ax-4 mission",
  "content": "Space SpaceX launches 4 people into orbit on Axiom Space Ax-4 mission June 25, 2025 2:43 AM ET By Brendan Byrne A SpaceX Falcon 9 rocket launches a Crew Dragon capsule from NASA's Kennedy Space Center in Florida on Wednesday. The Ax-4 mission is the fourth private spaceflight for the Houston-based commercial company, which is flying four astronauts on a two-week trip to the International Space Station. John Raoux/AP hide caption toggle caption John Raoux/AP A private space crew of four soared into orbit during a middle-of-the-night launch on a SpaceX Falcon 9 rocket Wednesday from the Kennedy Space Center in Florida. Space How the U.S. became highly reliant on Elon Musk for access to space It's the fourth mission brokered by the Houston, Texas-based commercial space company Axiom Space . The company works with SpaceX for rides to the International Space Station and coordinates with NASA for the usage of the I.S.S. for its astronauts. The European Space Agency and the governments of the participating astronauts also contributed to the mission. The Ax-4 launch comes after multiple issues delayed the mission. First, an attempt to launch earlier this month was waived off due to weather. Then, the crew's rocket — SpaceX's Falcon 9 — developed a leak. The mission was then delayed for nearly two weeks as NASA and its Russian space station partner, Roscosmos, investigated a leak on the station's Zvedzda service module, one that has previously been repaired and monitored by flight controllers for years. NASA said the pressure in the module was stable, and the crew was given the all-clear to launch. Axiom's Peggy Whitson is serving as commander. Whitson, a retired NASA astronaut , has set numerous spaceflight records, including the most cumulative time in space by a U.S. astronaut. This mission will add to her 675-day record. Space The International Space Station retires soon. NASA won't run its future replacement. Shubhanshu Shukla of India is the mission's pilot. Poland's Sławosz Uznański-Wiśniewski and Hungary's Tibor Kapu will serve as mission specialists. The trip marks the return to human spaceflight for those countries — their first government-sponsored flights in more than 40 years, according to Axiom. \"Every crew brings something new to the table. I've been incredibly impressed by the dedication and the work ethic and the passion of this team,\" said Whitson. \"It's been a joy to train alongside them, and I'm looking forward to seeing them in microgravity. It's going to be fun.\" Indian astronaut Shubhanshu Shukla, Hungarian astronaut Tibor Kapu, U.S. astronaut Peggy Whitson and Polish astronaut Slawosz Uznanski-Wisniewski pose for a picture ahead of the Axiom Space Ax-4 mission to the International Space Station. India, Poland and Hungary are set to send people to space for the first time in decades on an American commercial mission to the I.S.S. Giorgio Viera/AFP via Getty Images hide caption toggle caption Giorgio Viera/AFP via Getty Images Now launched, it will take the crew a little over a day to catch up with and dock to the I.S.S. in SpaceX's Dragon capsule — currently targeting 7 a.m. ET on Thursday. Whitson will oversee the nearly 60 experiments planned for the crew during their 14-day stay aboard the station. \"We'll be conducting research that spans biology, material and physical sciences as well as technology demonstrations,\" said Whitson. \"We'll also be engaging with students around the world, sharing our experience and inspiring the next generation of explorers.\" The crew is making the trip in a brand new SpaceX Dragon spacecraft, designed to transport civil and commercial astronauts to the I.S.S. and other places in low-Earth orbit. The Dragon will remain docked at the station, standing ready to return the crew after their mission — splashing down off southern California in the Pacific Ocean. National Prada and Axiom Space reveal modernized NASA spacesuits for the 2026 moon landing Dragon is the only U.S. spacecraft certified by NASA to take astronauts to the space station. During a public feud earlier this month with President Trump, SpaceX founder Elon Musk threatened to decommission the Dragon spacecraft in a now-deleted post on X. Musk walked back on that statement shortly after posting. The agency's other option for astronaut transports — Boeing's Starliner capsule — faced significant delays and technical issues on a test flight last year. NASA made the decision to return that crew in a SpaceX Dragon capsule and return Starliner without a crew as it investigates the vehicle's issues. \"NASA is assessing the earliest potential for a Starliner flight to the International Space Station in early 2026, pending system certification and resolution of Starliner's technical issues,\" said NASA in a recent statement. \"The agency is still evaluating whether Starliner's next flight will be in a crew or cargo configuration.\" This is the 18th time SpaceX has launched humans into orbit. SpaceX Axiom Space International Space Station ISS",
  "published_date": "2025-06-26 00:00:00",
  "category": "science",
  "word_count": 807,
  "content_extraction_status": "success",
  "failure_reason": null,
  "feed_name": "TLDR Tech",
  "scraped_at": "2025-06-28T00:42:10.572559"
}