{
  "url": "https://developers.googleblog.com/en/google-cloud-donates-a2a-to-linux-foundation/?utm_source=tldrai",
  "title": "Google Cloud donates A2A to Linux Foundation",
  "content": "English Español (Latam) Bahasa Indonesia 日本語 한국어 Português (Brasil) 简体中文 Cloud Google Cloud donates A2A to Linux Foundation JUNE 23, 2025 Rao Surapaneni VP and GM Business Application Platform Todd Segal Principal Engineer Business Application Platform Michael Vakoc Product Manager Google Cloud Today at Open Source Summit North America, the Linux Foundation announced the formation of the Agent2Agent project with Amazon Web Services , Cisco , Google, Microsoft , Salesforce , SAP , and ServiceNow . With the formation of this new, independent entity, the companies will collaborate closely on fostering an open and interoperable ecosystem for AI agents with the Agent2Agent (A2A) protocol and other interoperability technology. The project will be hosted by the Linux Foundation and will be seeded with Google’s transfer of the groundbreaking Agent2Agent (A2A) protocol specification, accompanying SDKs, and developer tooling. The A2A protocol , an open standard for communication and collaboration between distinct AI agents, aims to break down the silos that currently limit the potential of artificial intelligence. More than 100 companies now support the protocol, with AWS and Cisco as its newest validators. By providing a common language for AI agents to discover each other’s capabilities, securely exchange information, and coordinate complex tasks, the A2A protocol is paving the way for a new era of more powerful, collaborative, and innovative AI applications. The formation of the Agent2Agent project under the neutral governance of the Linux Foundation will ensure that this critical component remains vendor-agnostic and community-driven. This move is designed to accelerate the adoption and development of the A2A protocol by providing a robust framework for open collaboration, intellectual property management, and long-term stewardship. A2A protocol founding members At AWS, we believe agentic AI will be critical to nearly any customer experience. We welcome A2A joining The Linux Foundation and envision it will create broader opportunities for anyone building AI-powered apps. We intend to support the community with project contributions, and access to the broadest and deepest set of agentic frameworks, protocols, and services. – Swami Sivasubramanian, VP of AWS Agentic AI We've always believed in the vision of an open, interoperable Internet of Agents, and we're joining the A2A Project as foundational members because community-driven development is the fastest path to widespread agent-to-agent adoption. We're integrating A2A support directly into key AGNTCY open source components - the Directory, Identity, SLIM Messaging, and Observability frameworks - to build the interoperability layer that actually works across vendor boundaries. – Vijoy Pandey, GM and SVP of Outshift by Cisco Open standards are essential—but they’re only part of the equation. Microsoft is committed to shaping the future of agentic AI by combining open interoperability with the enterprise-grade capabilities that organizations need to deploy agents responsibly and at scale. We welcome the announcement of A2A as a neutral nonprofit project and look forward to collaborating as we help lead this next chapter of open standards for developing agents. – Yina Arenas, VP of Product, Azure AI Foundry At Salesforce, we believe the future of enterprise AI lies in seamless agent-to-agent collaboration. That's why we are excited to be part of the Linux Foundation's A2A Project. By helping set these crucial standards, we're extending our open platform to empower Agentforce to orchestrate solutions from disconnected systems, ensuring secure, scalable interoperability and an enhanced digital workforce across all ecosystems. – Gary Lerhaupt, VP, Product Architecture, Salesforce SAP has joined Google Cloud and other enterprise leaders as a founding contributor to the new A2A protocol. This open standard is designed to ensure agents from different vendors can interact, share context, and work together—enabling seamless automation across traditionally disconnected systems. – Walter Sun, SVP and Global Head of AI, SAP SE ServiceNow is proud to be a founding partner of the Agent2Agent protocol—an open standard built for cross-platform collaboration, governed by shared principles, and evolving through community input. With our AI Agent Control Tower capabilities and enterprise-grade AI Platform for business transformation, ServiceNow is uniquely positioned to help bring A2A to life alongside Google Cloud and the broader community. This is a critical step forward—not just for our customers, but for the entire ecosystem—as we enable intelligent agents that are open, secure, and scalable. – Joe Davis, EVP of Platform Engineering & AI Technology Group, ServiceNow Key Objectives of the Agent2Agent Foundation Establish an open standard: Drive the evolution and adoption of the A2A specification as the premier industry standard for AI agent interoperability, ensuring universal compatibility. Foster a vibrant ecosystem: Cultivate a diverse global community of developers, researchers, and companies, accelerating the creation of innovative A2A-based technologies and applications. Ensure neutral governance: Provide a level playing field for all contributors and consumers, managed under the trusted, open-governance framework of the Linux Foundation. Accelerate secure innovation: Encourage the development of novel applications and services that leverage the power of secure, collaborative AI agents. “We are happy to be the new home of the Agent2Agent Protocol project,\" said Jim Zemlin, Executive Director of the Linux Foundation. “By joining the Linux Foundation, A2A is ensuring the long-term neutrality, collaboration and governance that will unlock the next era of agent-to-agent powered productivity.\" What’s Next We continue to work with our partners and others in the space towards a broader set of open standards that complement the A2A protocol across topics like trustworthy agent identity, delegated agent authority, governance policy, agent security and reputation. The A2A Project invites all organizations and individuals passionate about the future of AI to join the community and contribute. For more information about the A2A protocol and how to get involved, please visit the Agent2Agent project GitHub . posted in: Cloud AI Announcements Industry Trends Cisco Amazon AI agent interoperability linux foundation Agentic AI A2A Agentic tools open source Previous Next Related Posts AI Cloud Case Studies How-To Guides Unlock deeper insights with the new Python client library for Data Commons JUNE 26, 2025 Cloud Gemini AI Cloud Announcements Gemini Code Assist in Apigee API Management now generally available JUNE 18, 2025 Cloud Cloud Announcements Solutions Data-driven marketing starts with developers MAY 29, 2025 Gemma AI Announcements Introducing Gemma 3n: The developer guide JUNE 26, 2025",
  "published_date": "2025-06-25 00:00:00",
  "category": "ai",
  "word_count": 1017,
  "content_extraction_status": "success",
  "failure_reason": null,
  "feed_name": "TLDR AI",
  "scraped_at": "2025-06-28T00:42:10.619116"
}